         IDENTIFICATION DIVISION.
         PROGRAM-ID. hello.
         PROCEDURE DIVISION.
         INICIO.
          DISPLAY '--- HELLO WORD---'.
         STOP RUN.
        
