       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello.
       PROCEDURE DIVISION.
       INICIO.
           DISPLAY '--- HELLO WORD---' LINE 5 POSITION 30.
           STOP RUN.
