       IDENTIFICATION DIVISION.
       PROGRAM-ID. CONSULTA-USER.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ARCHIVO-SALIDA ASSIGN TO "data-user.dat"
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS NUMDOC
               FILE STATUS IS WS-FS-SALIDA.
       
       DATA DIVISION.
       FILE SECTION.
       
       FD ARCHIVO-SALIDA.
       01 USUDATA.
           05 NUMDOC PIC 9(13).
           05 RAZSOC PIC X(50).
           05 DIRECT PIC X(50).
           05 CIUDAD PIC X(20).
           05 CONTAC PIC X(30).
           05 TEL-1 PIC X(10).
           05 TEL-2 PIC X(10).
           05 CORREO PIC X(100).
       
       WORKING-STORAGE SECTION.
       01 MANAGE-DATA.
           05 WS-FS PIC XX.
           05 WS-FS-SALIDA PIC XX.
           05 WS-OPCION PIC X.
           05 LIM PIC X(80) VALUE SPACES.
           05 CONTADOR PIC 9(2) VALUE 0.
       
       PROCEDURE DIVISION.
       INICIO.
           PERFORM CLEAR-SCREEN.
           OPEN I-O ARCHIVO-SALIDA.
           IF WS-FS-SALIDA NOT = "00"
               DISPLAY "Error al abrir el archivo. FS = " WS-FS-SALIDA
               STOP RUN
           END-IF.
           PERFORM CONSULT-DATA UNTIL WS-OPCION = "Q".
           CLOSE ARCHIVO-SALIDA.
           DISPLAY "DIGITE EL NUMERO DE CEDULA" LINE 5 POSITION 20.
           ACCEPT NUMDOC LINE 5 POSITION 40.
           PERFORM CONSULT-DATA UNTIL WS-OPCION = "Q".
           STOP RUN.
       
       CONSULT-DATA.
           READ ARCHIVO-SALIDA 
               RECORD KEY IS NUMDOC 
               INVALID KEY  
                 PERFORM CLEAR-SCREEN
                 DISPLAY "CLIENTE NO ENCONTRADO" LINE 5 POSITION 20
               NOT INVALID KEY
                 DISPLAY "--------------------------" LINE 5 POSITION 20
                 DISPLAY "NUMERO DE DOCUMENTO" LINE 6 POSITION 20
                 DISPLAY NUMDOC LINE 6 POSITION 40
                 DISPLAY "RAZON SOCIAL" LINE 7 POSITION 20
                 DISPLAY RAZSOC LINE 7 POSITION 40
                 DISPLAY "DIRECCION" LINE 8 POSITION 20
                 DISPLAY DIRECT LINE 8 POSITION 40
                 DISPLAY "CIUDAD" LINE 9 POSITION 20
                 DISPLAY CIUDAD LINE 9 POSITION 40
                 DISPLAY "CONTACTO" LINE 10 POSITION 20
                 DISPLAY CONTAC LINE 10 POSITION 40
                 DISPLAY "TELEFONO #1" LINE 11 POSITION 20
                 DISPLAY TEL-1 LINE 11 POSITION 40
                 DISPLAY "TELEFONO #2" LINE 12 POSITION 20
                 DISPLAY TEL-2 LINE 12 POSITION 40
                 DISPLAY "CORREO" LINE 13 POSITION 20
                 DISPLAY CORREO LINE 13 POSITION 40
           END-READ.
           DISPLAY "R->CONSULTAR UN NUEVO CLIENTE" LINE 20 POSITION 20.
           DISPLAY "Q->SALIR" LINE 21 POSITION 20.
           ACCEPT WS-OPCION LINE 21 POSITION 40.
           EVALUATE WS-OPCION
             WHEN "R"
               PERFORM CLEAR-SCREEN
               PERFORM INICIO
             WHEN "Q"
               PERFORM CLEAR-SCREEN 
               DISPLAY "--- ADIOS ;P ---" LINE 15 POSITION 30
             WHEN OTHER
               DISPLAY "DIGITA DE NUEVO LA OPCION" LINE 23 POSITION 20
           END-EVALUATE.
       
       CLEAR-SCREEN.
           MOVE " " TO LIM.
           DISPLAY LIM LINE 1 POSITION 1 ERASE EOS.


